/*++----------------------------------------------------------------------------------------------------------------------------------------------------------------------
1. 项目名称：有房有客微信CDN框架
2. 文件名：libs -> localCache.js
3. 作者：42547335@qq.com
4. 备注：由于ios的无痕模式，也就是隐私浏览模式是阻止写入localStorage的，导致有些地方使用这个功能的时候受挫，所以对localStorage做了一定程度的封装
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------++*/
window.localCache = {
    set : ( key , value ) => {
        try {                   
            window.localStorage.setItem( key , value ) ;
        } 
        catch(e) {
            console.log("本地储存写入错误，若为safari浏览器请关闭无痕模式浏览！") ;
        }
    } ,
    get : ( key ) => {
        return window.localStorage.getItem( key ) ;
    } ,
    destroy : (key) => {        
        window.localStorage.removeItem(key) ;
    }
} ;